README diagrams update
